matching-service/test/load_test.yml
config:
  target: "http://34.160.41.4"
  timeout: 30
  phases:
    - name: 'load test'
      duration: 30
      arrivalRate: 10
  engines:
    socketio-v3: { "transports": ["websocket"] }

scenarios:
  - name: match
    engine: socketio-v3
    flow:
      - emit:
          channel: "match"
          data:
            username: '{{ $randomString() }}'
            difficulty: 'HIGH'
        response:
          channel: "matchSuccess"
          match: 
            json: "$.message"
            value: "success"
      - think: 1